       IDENTIFICATION DIVISION.
       PROGRAM-ID.      MOTOAPP.
       AUTHOR.          BRUNO CARVALHO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    10/06/2021.
       DATE-COMPILED.   10/06/2021.
       SECURITY.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
            
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 BASE  PIC 9(4)V99 VALUE ZEROS.
       77 KM    PIC 9(2)V99 VALUE ZEROS.
       77 TOT   PIC 9(3)V99 VALUE ZEROS.

       SCREEN SECTION.
       01 TELA.

           02 BLANK SCREEN.
           02 LINE 02 COL 21 VALUE "PROGRAMA PARA MOTORISTA DE APP".
           02 LINE 05 COL 21 VALUE "ENTRE COM KM TOTAL: ".
           02 LINE 06 COL 21 VALUE "VALOR TOTAL DA CORRIDA: ".

       PROCEDURE DIVISION.

       INICIO.
           DISPLAY TELA.

        DIGITACAO.
           ACCEPT KM AT 0550.

        CALCULO.
           COMPUTE TOT = 5+ (4,50 * KM) . 
        
        EXIBE-RESULTADO.
           DISPLAY TOT AT 0650.
           DISPLAY "FINAL DO PROGRAMA - CUSTO DO CARRO" AT 1021.
           STOP RUN.
