       IDENTIFICATION DIVISION.
       PROGRAM-ID.      CUSTOCARRO.
       AUTHOR.          BRUNO CARVALHO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    10/06/2021.
       DATE-COMPILED.   10/06/2021.
       SECURITY.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
            
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 CFAB  PIC 9(8) VALUE ZEROS.
       77 CCON  PIC 9(8) VALUE ZEROS.

       SCREEN SECTION.
       01 TELA.

           02 BLANK SCREEN.
           02 LINE 02 COL 21 VALUE "PROGRAMA PARA CUSTO DO CARRO".
           02 LINE 05 COL 21 VALUE "ENTRE COM CUSTO DE FµBRICA: ".
           02 LINE 06 COL 21 VALUE "CUSTO FINAL AO CONSUMIDOR: ".

       PROCEDURE DIVISION.

       INICIO.
           DISPLAY TELA.

        DIGITACAO.
           ACCEPT CFAB AT 0550.

        CALCULO.
           COMPUTE CCON = CFAB + ( (CFAB * 73) /100). 
        
        EXIBE-RESULTADO.
           DISPLAY CCON AT 0650.
           DISPLAY "FINAL DO PROGRAMA - CUSTO DO CARRO" AT 1021.
           STOP RUN.
