       IDENTIFICATION DIVISION.
       PROGRAM-ID.      TRIANGULO.
       AUTHOR.          BRUNO CARVALHO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    10/06/2021.
       DATE-COMPILED.   10/06/2021.
       SECURITY.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
            
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 LARGURA  PIC 9(3).
       77 ALTURA   PIC 9(3).
       77 AAREA    PIC 9(6).

       SCREEN SECTION.
       01 TELA.

           02 BLANK SCREEN.
           02 LINE 02 COL 21 VALUE "PROGRAMA PARA µREA DO TRI∂NGULO".
           02 LINE 05 COL 21 VALUE "ENTRE COM LARGURA: ".
           02 LINE 06 COL 21 VALUE "ENTRE COM ALTURA: ".
           02 LINE 07 COL 21 VALUE "O CALCULO DA AREA ê:".

       PROCEDURE DIVISION.

       INICIO.
           DISPLAY TELA.

        DIGITACAO.
           ACCEPT LARGURA AT 0550.
           ACCEPT ALTURA AT 0650.

        CALCULO.
           COMPUTE AAREA = (LARGURA*ALTURA) /2.
        
        EXIBE-RESULTADO.
           DISPLAY AAREA AT 0750.
           DISPLAY "FINAL DO PROGRAMA - µREA DO TRI∂NGULO" AT 1021.
           STOP RUN.
