       IDENTIFICATION DIVISION.
       PROGRAM-ID.      VENDEDOR.
       AUTHOR.          BRUNO CARVALHO.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    10/06/2021.
       DATE-COMPILED.   10/06/2021.
       SECURITY.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES. CURRENCY SIGN IS "$".
                          
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 QCV  PIC 999 VALUE ZEROS.
       77 TV   PIC 999999V99.
       77 SF   PIC 999999V99.
       77 CFC  PIC 99v99 VALUE ZEROS.
       77 SFV  PIC 999999V99.
                           
       SCREEN SECTION.
       01 TELA.

           02 BLANK SCREEN.
           02 LINE 02 COL 15 VALUE "PROGRAMA SALµRIO FINAL DO VENDEDOR".
           02 LINE 05 COL 15 VALUE "QUANTIDADE DE CARROS VENDIDOS: ".
           02 LINE 06 COL 15 VALUE "TOTAL DE VENDAS: ".
           02 LINE 07 COL 15 VALUE "SALµRIO FIXO: ".
           02 LINE 08 COL 15 VALUE "COMISSÇO FIXA POR CARRO: ".
           02 LINE 09 COL 15 VALUE "SALµRIO FINAL DO VENDEDOR: ".

       PROCEDURE DIVISION.

       INICIO.
           DISPLAY TELA.

        DIGITACAO.
           ACCEPT QCV AT 0550.
           ACCEPT TV  AT 0650.
           ACCEPT SF  AT 0750.
           ACCEPT CFC AT 0850.

        CALCULO.
           COMPUTE SFV = SF+((TV/QCV)*(CFC/100))+(TV*(5/100)). 
        
        EXIBE-RESULTADO.
           DISPLAY SFV AT 0950.
           DISPLAY "FINAL DO PROGRAMA - CUSTO DO CARRO" AT 1315.
           STOP RUN.
